Revit 2024 API
AssemblyInstance.GetMemberIds Method
 Gets member element ids for the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ICollection<ElementId> GetMemberIds()
Visual Basic
Public Function GetMemberIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetMemberIds()
Return Value
 Element ids for the members of the assembly instance.
See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace